package _05_26;

/*
**문제설명**

히스토그램은 N개의 직사각형 모양의 막대가 아래 그림과 같이 붙어있는
그래프입니다. 아래의 예시는 N=6인 경우의 예시입니다.
히스토그램의 각 칸의 간격은 1이며 높이는 정수로 주어집니다.
히스토그램의 영역이란 히스토그램의 막대 중 두 개를 선택한 후 두 막대
사이에 물을 채웠을 때 물이 최대로 차오를 수 있는 영역의 넓이를 말합니다.
다음의 예시는 두 개의 막대를 선택했을 때 두 막대 사이에 물을 최대로 채운
예시입니다.
0번째 막대는 6의 길이를 가집니다.
1번째 막대는 5의 길이를 가집니다.
2번째 막대는 7의 길이를 가집니다.
3번쨰 막대는 3의 길이를 가집니다.
4번쨰 막대는 4의 길이를 가집니다.
5번째 막대는 2의 길이를 가집니다.

1번째 막대와 3번째 막대를 선택했을 때 히스토그램의 영역의 넓이는
12입니다.
2번째 막대와 4번째 막대를 선택했을 때 히스토그램의 영역의 넓이는 6입니다.

즉 위와 같은 방식으로 두 개의 막대를 선택하며 물이 최대로 차오를 수 있는
히스토그램 영역의 넓이는 12이며, 히스토그램의 높이가 배열 형태로 주어질
때, 만들 수 있는 히스토그램의 영역 중 최대값을 반환하는 soultion함수를
완성해주세요.

**제한사항**
히스토그램의 막대의 개수 N = 100,000이하의 자연수
히스토그램의 막대의 높이 H = 10,000이하의 음이 아닌 정수

**입출력예**
histogram = [2,2,2,3] , return = 4
0번과 3번 막대를 사용하여 최대 영역의 넓이인 4를 만들 수 있습니다.
histogram = [6,5,7,3,4,2] , return = 12
0번과 4번 막대를 사용하여 최대 영역의 넓이인 12를 만들 수 있습니다.
 */
public class Problem_03 {

}
